---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericDiffuseImageFade
source: html/93574367-b9ea-3328-38da-51b54da1b065.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericDiffuseImageFade Property

The property labeled "Image Fade" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericDiffuseImageFade { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".